<?php

return [
    /*
    |-----------------------------------------------------------
    | 【必填】企业 corpId
    |-----------------------------------------------------------
    */
    'corp_id' => 'ccc',

    /*
    |-----------------------------------------------------------
    | 【必填】应用 AppKey
    |-----------------------------------------------------------
    */
    'app_key' => 'bbb',

    /*
    |-----------------------------------------------------------
    | 【必填】应用 AppSecret
    |-----------------------------------------------------------
    */
    'app_secret' => 'aaa',

    /*
    |-----------------------------------------------------------
    | 【选填】加解密
    |-----------------------------------------------------------
    | 此处的 `token` 和 `aes_key` 用于事件通知的加解密
    | 如果你用到事件回调功能，需要配置该两项
    */
    'token' => 'uhl3CZbtsmf93bFPanmMenhWwrqbSwPc',
    'aes_key' => 'qZEOmHU2qYYk6n6vqLfi3FAhcp9bGA2kgbfnsXDrGgN',

    /*
    |-----------------------------------------------------------
    | 【选填】后台免登配置信息
    |-----------------------------------------------------------
    | 如果你用到应用管理后台免登功能，需要配置该项
    */
    'sso_secret' => 'Fx9_i5dSW5tpGtjalksdf98JF8uj32xb4NJQR5G9-VSchasd98asfdMmLR',

    /*
    |-----------------------------------------------------------
    | 【选填】第三方网站 OAuth 授权
    |-----------------------------------------------------------
    | 如果你用到扫码登录、钉钉内免登和密码登录第三方网站，需要配置该项
    */
    'oauth' => [
        /*
        |-------------------------------------------
         | `app-01` 为你自定义的名称，不要重复即可
         |-------------------------------------------
         | 数组内需要配置 `client_id`, `client_secret`, `scope` 和 `redirect` 四项
         |
         | `client_id` 为钉钉登录应用的 `appId`
         | `client_secret` 为钉钉登录应用的 `appSecret`
         | `scope`:
         |     - 扫码登录第三方网站和密码登录第三方网站填写 `snsapi_login`
         |     - 钉钉内免登第三方网站填写 `snsapi_auth`
         | `redirect` 为回调地址
         */
        'app-01' => [
            'client_id' => 'aaa',
            'client_secret' => 'bbb-Tu2CsUZN-ZlQXWQ',
            'scope' => 'snsapi_login',
            'redirect' => 'https://example.com',
        ],
        /*
        |-------------------------------------------
         | 可配置多个 OAuth 应用，数组内内容同上
         |-------------------------------------------
         */
        'app-02' => [
            // ...
        ]
    ]
];
